example/src/test/resources/data/soap/expected.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns2:getItemRequest xmlns:ns2="http://ws.io">
            <date>{{now 'yyyy-MM-dd' minus='1 y'}}</date>
        </ns2:getItemRequest>
    </soap:Body>
</soap:Envelope>